#+TITLE: Homework 1
#+AUTHOR: Sriram Krishnaswamy
#+DATE: 
#+OPTIONS: toc:nil

** Correlation

#+NAME: hw01_correlation_data
#+begin_src matlab
load('./may_first_week.mat');
figure('visible','off')
plot(dep_data,arr_data);
xlabel('Departure data')
ylabel('Arrival data')
print -dpng -r0 hw01_dep_arrival_correlation_fig.png 
R = corrcoef(dep_data, arr_data);
ans = R;
#+end_src

#+RESULTS: hw01_correlation_data
| NaN | NaN |
| NaN | NaN |

** Correlation given the flight departs late

#+NAME: hw01_dep_delay_arr_correlation
#+begin_src matlab
load('./may_first_week.mat');
dep_delay = [];
dep_delay_count = 0;
dep_delay_index = [];
for i = 1:size(dep_data)
    if (dep_data(i) > 0)
        dep_delay_count = dep_delay_count+1;
        dep_delay(dep_delay_count) = dep_data(i);
        dep_delay_index(dep_delay_count) = i;
    end
end
arr_delay_given_dep_delay = [];
for j = 1:dep_delay_count
    arr_delay_given_dep_delay(j) = arr_data(dep_delay_index(j));
end
figure('visible','off')
plot(dep_delay,arr_delay_given_dep_delay);
xlabel('Departure data')
ylabel('Arrival data')
print -dpng -r0 hw01_dep_delay_arrival_correlation_fig.png 
R = corrcoef(dep_delay, arr_delay_given_dep_delay);
ans = R;
#+end_src

#+RESULTS: hw01_dep_delay_arr_correlation
|   1 | NaN |
| NaN | NaN |

